; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p11---int100n150-m25---int100c110---s361---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level12 level12)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level19 level19)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level12 level13)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level19 level20)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level12 level14)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level19 level21)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level12 level15)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level19 level22)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level12 level16)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level19 level23)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level12 level17)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level19 level24)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level12 level18)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level19 level25)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level12 level19)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level19 level26)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level12 level20)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level19 level27)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level12 level21)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level19 level28)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level12 level22)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level19 level29)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level12 level23)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level19 level30)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level12 level24)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level19 level31)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level12 level25)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level19 level32)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level12 level26)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level19 level33)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level12 level27)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level19 level34)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level12 level28)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level19 level35)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level12 level29)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level19 level36)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level12 level30)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level19 level37)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level12 level31)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level19 level38)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level12 level32)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level19 level39)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level12 level33)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level19 level40)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level12 level34)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level19 level41)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level12 level35)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level19 level42)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level12 level36)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level19 level43)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level12 level37)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level19 level44)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level12 level38)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level19 level45)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level12 level39)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level19 level46)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level12 level40)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level19 level47)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level12 level41)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level12 level42)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level12 level43)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level12 level44)
(sum level32 level15 level47)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level12 level45)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level12 level46)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level12 level47)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level42 level1 level43)
(sum level43 level1 level44)
(sum level44 level1 level45)
(sum level45 level1 level46)
(sum level46 level1 level47)

(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l0 l3)
(fuelcost level10 l0 l3)
(connected l0 l4)
(fuelcost level15 l0 l4)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l5)
(fuelcost level12 l1 l5)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l4)
(fuelcost level10 l2 l4)
(connected l2 l5)
(fuelcost level8 l2 l5)
(connected l3 l0)
(fuelcost level10 l3 l0)
(connected l3 l4)
(fuelcost level1 l3 l4)
(connected l3 l5)
(fuelcost level19 l3 l5)
(connected l4 l0)
(fuelcost level15 l4 l0)
(connected l4 l2)
(fuelcost level10 l4 l2)
(connected l4 l3)
(fuelcost level1 l4 l3)
(connected l5 l1)
(fuelcost level12 l5 l1)
(connected l5 l2)
(fuelcost level8 l5 l2)
(connected l5 l3)
(fuelcost level19 l5 l3)

(at t0 l1)
(fuel t0 level47)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l4)
(at p3 l5)
(at p4 l2)
(at p5 l1)
(at p6 l1)
(at p7 l5)
(at p8 l2)
(at p9 l5)
(at p10 l1)
)

(:goal
(and
(at p0 l5)
(at p1 l4)
(at p2 l0)
(at p3 l2)
(at p4 l5)
(at p5 l2)
(at p6 l4)
(at p7 l4)
(at p8 l3)
(at p9 l0)
(at p10 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 11
2. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 11
3. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 11
4. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 11
5. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 11
6. (drive t0 l1 l2 level41 level6 level47)
   deleted: (at t0 l1) (fuel t0 level47)
   added: (at t0 l2) (fuel t0 level41)
   goals met: 0 of 11
7. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 11
8. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 11
9. (drive t0 l2 l5 level33 level8 level41)
   deleted: (at t0 l2) (fuel t0 level41)
   added: (at t0 l5) (fuel t0 level33)
   goals met: 0 of 11
10. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 11
11. (load p7 t0 l5)
   deleted: (at p7 l5)
   added: (in p7 t0)
   goals met: 0 of 11
12. (load p9 t0 l5)
   deleted: (at p9 l5)
   added: (in p9 t0)
   goals met: 0 of 11
13. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 1 of 11
14. (unload p4 t0 l5)
   deleted: (in p4 t0)
   added: (at p4 l5)
   goals met: 2 of 11
15. (drive t0 l5 l2 level25 level8 level33)
   deleted: (at t0 l5) (fuel t0 level33)
   added: (at t0 l2) (fuel t0 level25)
   goals met: 2 of 11
16. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 11
17. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 4 of 11
18. (drive t0 l2 l4 level15 level10 level25)
   deleted: (at t0 l2) (fuel t0 level25)
   added: (at t0 l4) (fuel t0 level15)
   goals met: 4 of 11
19. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 4 of 11
20. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 5 of 11
21. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 6 of 11
22. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 7 of 11
23. (drive t0 l4 l3 level14 level1 level15)
   deleted: (at t0 l4) (fuel t0 level15)
   added: (at t0 l3) (fuel t0 level14)
   goals met: 7 of 11
24. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 8 of 11
25. (drive t0 l3 l0 level4 level10 level14)
   deleted: (at t0 l3) (fuel t0 level14)
   added: (at t0 l0) (fuel t0 level4)
   goals met: 8 of 11
26. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 9 of 11
27. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 10 of 11
28. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 11 of 11
